[UI_TREE]
EDITCfg = Modifier les paramètres
MARKCfg = Paramètres de marquage
3DCfg = Paramètre 3D
ImportDxf_Type0Cfg=Paramètres d’importation DXF
SysCfg = Autres paramètres

[Edit]
EDIT=Modifier les paramètres
PointFilterPrecis = Précision du point de filtre (mm)
PointFilterAngle = angle de filtre (degrés)
PointPrecisMoveStep = Pas de déplacement de point (mm)
MICRO = Étape de réglage fin de la position (mm)
MICROROTATE = Taille des pas de réglage fin de l’angle (degrés)
CLICK = Précision du ramassage (mm)
UNDO = Nombre d’étapes annulées le nombre d’étapes
ONETOTWO = Précision du point d’arrêt (mm)
ExtendSpace = précision de mise à l’échelle (mm)
KillAngleSpace = précision de l’angle de guidage (mm)
PreViewZoomScale = zoom d’aperçu
LayerCnt = nombre de niveaux
JoinDistance = Distance maximale de fusion de courbe
FastDrawEnable = la ligne de remplissage affiche l’accélération
FastDrawEnableOption=Off|Activate

[MARK]
MARK = Paramètres de marquage
SafeDoorRemarque = si la porte de sécurité est fermée et s’il faut continuer à marquer
SafeDoorRemarkOption=Non|Oui
CloseRedIfMark = si le voyant rouge est automatiquement éteint lors du marquage
CloseRedIfMarkOption=Non|Oui
RedPreviewLayerNo = vitesse de marquage de l’aperçu de la lumière rouge

[3D]
3D = Paramètres 3D
3dModelPrecision = précision de traitement des modèles 3D
3dTrancePrecision = précision de conversion de données 3D
STLOptimize=Optimisation de la carte de modèle STL
STLOptimizeOption=Non|Oui

[ImportDxf_Type0]
ImportDxf_Type0=Paramètres d’importation DXF
SepArc = Précision de l’arc (5 ~ 255)
SepSpLine = précision de la spline (5 ~ 255)

[Sys]
Sys=Autres paramètres
CIRCLEPRECIS = Précision de l’arc (mm)
SAMPLECOUNT = Nombre d’échantillons par segment de l’arc
AIIMPORTPRECIS=Précision de l’importation de fichiers AI (mm)
PowerFill = Optimisation de la vitesse de remplissage
PowerFillOption=Non|Oui
PowerDraw = Optimisation de la vitesse de dessin
PowerDrawOption=Non|Oui
PowerRPViewFrame = optimisation des bordures d’aperçu de la lumière rouge
PowerRPViewFrameOption=Non|Oui

[UI_FACE]
ExportSysPara = Paramètre d’exportation...
ImportSysPara = paramètre d’importation...
Ok=OK
Cancel = Annuler
Apply =Appliquer

;3DCALI DLG MAIN
[DLG 6000]
1019 = paramètres de marquage

1021 = début du marquage

1022 = aperçu de la lumière rouge

1023 = marquage cyclique

1024 = exporter le fichier de correction

1025 = importer un fichier de correction

1027 = point de référence du moteur

1028 = position minimale de réglage

1029 = position de réglage maximale

1030 = incrément de correction

1031 = distance focale du plan de référence

1033 = paramètres

6000 = type de correction

6001 = paramètres de base

6002 = position du moteur

3 = générer un fichier de correction

4 = réinitialisation



;3DCALI DLG PARAM
[DLG 140]

1035 = nombre de marques

1036 = vitesse de marquage (MM / s)

1037 = vitesse de saut à vide (MM / s)

1038 = fréquence Q (kHz)

1039 = Q libéré (US)

1040 = courant (A)

1041 = puissance (%)

1042 = mode

1051 = Application

2 = annulation



;3DCALI STRING
[STRINGTABLE]

Motor position = position du moteur

Current Focus = longueur focale actuelle

Wrong Motor Parameters = erreur dans les paramètres du moteur

Motor Movement Failure = échec du mouvement du moteur

Motor increment out of Range (0,01 mm ~ 5 mm) = incrément de moteur hors de portée (0,01 mm ~ 5 mm)

Focus of base plane out of Range (> 0mm) = distance focale hors de portée du plan de référence (> 0mm)

Cali Data wrong, the focus must be monotonically Increasing / Decreasing = correction des erreurs de données, la distance focale doit être monotone incrémentée / décrémentée

Cali file detected, generation will modify the original file. It is recommended to back up (Export) the file first. Are you sure to continue generating? = Le fichier de correction existe déjà, la génération de la table de correction modifie le fichier de correction original, il est recommandé de le sauvegarder (exporter) avant de le générer. Continuer à générer?

Generating Cali file false: Unable to open / Create file = la génération du fichier corrigé a échoué: impossible d'ouvrir / créer le fichier

Generating Cali file false: Unable to write file = Échec de la génération du fichier corrigé: impossible d'écrire le fichier

Stop Marking = arrêter le marquage

Start Marking = commencer à marquer

Failed to stop Marking = arrêter le marquage échoue

Failed to start Marking = arrêter le marquage échoue

Export Success = exportation réussie

Export failed: can not find Cali file or copy file failed = Échec de l'exportation: impossible de trouver le fichier corrigé ou Échec de la copie du fichier

Import failed: Cali file does not exist = l'importation a échoué: le fichier de correction n'existe pas

Import failed: Unknow = l'importation a échoué: erreur inconnue

Cali file already exists, do you want to replace it = le fichier de correction existe déjà, est - il écrasé?

Import success = importation réussie

Import failed: Please manually copy the Cali file to the '\ \ emcc \ \ caliset \ \% cardid% \ \' directory = l'importation a échoué: Veuillez copier manuellement le fichier de correction sous le répertoire \ \ emcc \ caliset \% cardid% \ \

Data is not enough, please input at lease 2 rows = trop peu de données, veuillez entrer au moins deux lignes de données

Generation of Cali file successed = Fichier corrigé généré avec succès

Error: Handle of device.dll is null = Error: device.dll Handle est vide

Error: Card number wrong = erreur: numéro de carte incorrect

Error: Load device.dll or API failed = Error: Échec du chargement de device.dll ou de son API

Path of Cali file wrong or systemset.ini not found = correction d'une erreur de répertoire de fichier ou systemset.ini introuvable

Error: Open 3dmarker.dat failed = erreur: l'ouverture du fichier 3dmarker.dat a échoué

Error: Open.dat failed = erreur: l'ouverture du fichier.Dat a échoué

Error: Enter Mark Environment failed = erreur: l'entrée dans l'environnement de marquage a échoué

Error: Leave Mark Environment failed = erreur: la sortie de l'environnement de marquage a échoué